In [1]:
people = {
    "first" : ["Jacob","Jane","John"],
    "last" : ["Xi","Doe","Wick"],
    "email" : ["jacobxi@outlook.com","JaneDone@outlook.com", "JohnWick@outlook.com"]
}

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df['first']+ ' '+ df['last']

0     Jacob Xi
1     Jane Doe
2    John Wick
dtype: object

In [6]:
df['fullname']=df['first']+ ' '+ df['last']
df

   first  last                 email   fullname
0  Jacob    Xi   jacobxi@outlook.com   Jacob Xi
1   Jane   Doe  JaneDone@outlook.com   Jane Doe
2   John  Wick  JohnWick@outlook.com  John Wick

In [7]:
df.drop(columns=['first','last'],inplace=True)
df

                  email   fullname
0   jacobxi@outlook.com   Jacob Xi
1  JaneDone@outlook.com   Jane Doe
2  JohnWick@outlook.com  John Wick

In [10]:
df['fullname'].str.split(' ', expand=True)

       0     1
0  Jacob    Xi
1   Jane   Doe
2   John  Wick

In [13]:
df[['first','last']] = df['fullname'].str.split(' ', expand=True)
df

                  email   fullname  first  last
0   jacobxi@outlook.com   Jacob Xi  Jacob    Xi
1  JaneDone@outlook.com   Jane Doe   Jane   Doe
2  JohnWick@outlook.com  John Wick   John  Wick

In [16]:
df.append({'first':'tony'}, ignore_index=True)

                  email   fullname  first  last
0   jacobxi@outlook.com   Jacob Xi  Jacob    Xi
1  JaneDone@outlook.com   Jane Doe   Jane   Doe
2  JohnWick@outlook.com  John Wick   John  Wick
3                   NaN        NaN   tony   NaN

In [17]:
avengers = {
    "first" : ["Tony","Steve"],
    "last" : ["Stark","Rogers"],
    "email" : ["IronMan@avenge.com","Cap@avenge.com"]
}

df2 = pd.DataFrame(avengers)

In [18]:
df.append(df2)

/usr/local/lib/python3.7/site-packages/pandas/core/frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

                  email  first   fullname    last
0   jacobxi@outlook.com  Jacob   Jacob Xi      Xi
1  JaneDone@outlook.com   Jane   Jane Doe     Doe
2  JohnWick@outlook.com   John  John Wick    Wick
0    IronMan@avenge.com   Tony        NaN   Stark
1        Cap@avenge.com  Steve        NaN  Rogers

In [22]:
df=df.append(df2, ignore_index=True, sort=False)
df

                  email   fullname  first    last
0   jacobxi@outlook.com   Jacob Xi  Jacob      Xi
1  JaneDone@outlook.com   Jane Doe   Jane     Doe
2  JohnWick@outlook.com  John Wick   John    Wick
3    IronMan@avenge.com        NaN   Tony   Stark
4        Cap@avenge.com        NaN  Steve  Rogers

In [23]:
df.drop(index=4)

                  email   fullname  first   last
0   jacobxi@outlook.com   Jacob Xi  Jacob     Xi
1  JaneDone@outlook.com   Jane Doe   Jane    Doe
2  JohnWick@outlook.com  John Wick   John   Wick
3    IronMan@avenge.com        NaN   Tony  Stark

In [24]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                  email   fullname  first    last
0   jacobxi@outlook.com   Jacob Xi  Jacob      Xi
2  JohnWick@outlook.com  John Wick   John    Wick
3    IronMan@avenge.com        NaN   Tony   Stark
4        Cap@avenge.com        NaN  Steve  Rogers